; domain
(define (domain CleaningBot)
(:requirements :typing)
(:types robot surface place area dirt - object
	house_surface dumparea - place
	dirtTiles home houseTiles - area )

(:predicates (clear ?s - (either dirtTiles houseTiles))
	     (in ?x - (either dirtTiles dirt houseTiles) ?p - place)
	     (available ?r - robot) 
	     (grabing ?r - robot ?d - dirt) 
	     (at ?r - robot ?a - area)
	     (on ?d - dirt ?s - (either dirtTiles houseTiles)) 
	     (connected ?a1 ?a2 - area)) 

;With this action the robot will grab the dirt from the house tile. 
;Precondition of grabbing a dirt object is that the bot's hand needs to be available and 
;the bot needs to be on any tile that is directly connected to the tile where dirt is present.
;effect will be that robot's hand will become unavailable
(:action grab
 :parameters (?r - robot ?d - dirt ?a1 - houseTiles ?a2 - area ?p - place)
 :precondition (and (connected ?a1 ?a2) (at ?r ?a2) (available ?r) 
		    (on ?d ?a1) (in ?a1 ?p))
 :effect (and (not (on ?d ?a1)) (clear ?a1)
	      (not (available ?r)) (grabing ?r ?d) (not (in ?d ?p))))


; With this action the robot will drop the dirt into the dustbins according to the nature of the dirt. 
; Precondition of dropping a dirt object is that the bot needs to be on any tile that is directly connected to the tile where the particular dustbin is present.	
; Effect will be that the robot's hand will be available after dropping the object.			
(:action drop
 :parameters (?r - robot ?d - dirt ?a1 - dirtTiles ?a2 - area ?p - place)
 :precondition (and (connected ?a1 ?a2) (at ?r ?a2) (grabing ?r ?d) 
		    (clear ?a1) (in ?a1 ?p))
 :effect (and (not (grabing ?r ?d)) (available ?r)
	      (not (clear ?a1)) (on ?d ?a1) (in ?d ?p)))


; navigations of the cleaning bot in the area where dustbins are kept, outside the house area. 
(:action move
 :parameters (?r - robot ?from ?to - dirtTiles)
 :precondition (and (at ?r ?from) (clear ?to) (connected ?from ?to))
 :effect (and (not (at ?r ?from)) (at ?r ?to) (not (clear ?to)) (clear ?from)))
 
; cleaning bot’s navigation inside the house area where dirts are present.
 (:action move-inside
 :parameters (?r - robot ?from ?to - houseTiles)
 :precondition (and (at ?r ?from) (clear ?to) (connected ?from ?to))
 :effect (and (not (at ?r ?from)) (at ?r ?to) (not (clear ?to))))

; The robot will go inside the house to grab the dirt. This action will work when it will find the connection between a dirtTile and houseTile. 
(:action go-in
 :parameters (?r - robot ?from - dirtTiles ?to - houseTiles)
 :precondition (and (at ?r ?from) (connected ?from ?to))
 :effect (and (not (at ?r ?from)) (at ?r ?to) (clear ?from)))

; When a dirt object is already in the robot's hand it will find the connection between houseTile and dirtTile to drop the object in dustbin.
(:action go-out
 :parameters (?r - robot ?from - houseTiles ?to - dirtTiles)
 :precondition (and (at ?r ?from) (connected ?from ?to) (clear ?to))
 :effect (and (not (at ?r ?from)) (at ?r ?to) (not (clear ?to))))
)

; problem
(define (problem Cleaning)
(:domain CleaningBot)
(:objects
	dumptile-1-1 dumptile-1-2 dumptile-1-3 dumptile-2-1 dumptile-2-2 dumptile-2-3 - dirtTiles ; Tiles of dump area
	housetile-1 housetile-2 housetile-3 housetile-4 housetile-5 housetile-6 - houseTiles ; Tiles of house area
	cleanBot - robot
	plastic glass organic - dirt ; dirt objects 
	houseSurface - house_surface
	empty plasticbin glassbin organicbin - dumparea ; dustbin objects
	)

(:init
	; connection between dirt tiles
	(connected dumptile-1-1 dumptile-2-1)
	(connected dumptile-1-1 dumptile-1-2)
	(connected dumptile-1-2 dumptile-2-2)
	(connected dumptile-1-2 dumptile-1-3)
	(connected dumptile-1-2 dumptile-1-1)
	(connected dumptile-1-3 dumptile-2-3)
	(connected dumptile-1-3 dumptile-1-2)
	(connected dumptile-2-1 dumptile-1-1)
	(connected dumptile-2-1 dumptile-2-2)
	(connected dumptile-2-2 dumptile-1-2)
	(connected dumptile-2-2 dumptile-2-3)
	(connected dumptile-2-2 dumptile-2-1)
	(connected dumptile-2-3 dumptile-1-3)
	(connected dumptile-2-3 dumptile-2-2)

	; location of the dustbins
	(in dumptile-1-1 empty)
	(in dumptile-1-2 glassbin)
	(in dumptile-1-3 organicbin)
	(in dumptile-2-1 plasticbin)
	(in dumptile-2-2 empty)
	(in dumptile-2-3 empty)

	; location of the dirts
	(on plastic housetile-1)
	(on glass housetile-2)
	(on organic housetile-3)
	(in plastic houseSurface)
	(in glass houseSurface)
	(in organic houseSurface)

	; housetiles are in house surface
	(in housetile-1 houseSurface)
	(in housetile-2 houseSurface)
	(in housetile-3 houseSurface)
    (in housetile-4 houseSurface)
    (in housetile-5 houseSurface)
    
    ; connection between house tiles
	(connected housetile-1 housetile-2)
    (connected housetile-2 housetile-1)
    (connected housetile-2 housetile-3)
    (connected housetile-3 housetile-2)
    (connected housetile-2 housetile-5)
    (connected housetile-5 housetile-2)  
	(connected housetile-3 housetile-4)
    (connected housetile-4 housetile-3)
    (connected housetile-3 housetile-5)
    (connected housetile-5 housetile-3)
	(connected housetile-4 housetile-5) 
    (connected housetile-5 housetile-4) 
    (connected housetile-5 housetile-6) 
    (connected housetile-6 housetile-5) 
     
    ; House area is connected with dump area through these two tiles.
	(connected dumptile-2-3 housetile-5) 
	(connected housetile-5 dumptile-2-3)  

	; dirt tiles are clear for robot to visit.
	(clear dumptile-1-1)
	(clear dumptile-1-2)
	(clear dumptile-2-3)
	(clear dumptile-2-1) 
	
	; house tiles are clear for robot to visit.
	(clear housetile-1)
	(clear housetile-2)
	(clear housetile-3)
	(clear housetile-4) 
	(clear housetile-5) 
	(clear housetile-6) 

	(at cleanBot dumptile-1-3) ; initial position of cleanBot
	(available cleanBot) ; cleanBot is available
	)

(:goal (and
	(in plastic plasticbin)
	(in glass glassbin)
	(in organic organicbin)
	))
)

; plan
1. (move cleanbot dumptile-1-3 dumptile-2-3)
   deleted: (at cleanbot dumptile-1-3) (clear dumptile-2-3)
   added: (at cleanbot dumptile-2-3) (clear dumptile-1-3)
   goals met: 0 of 3
2. (go-in cleanbot dumptile-2-3 housetile-5)
   deleted: (at cleanbot dumptile-2-3)
   added: (at cleanbot housetile-5) (clear dumptile-2-3)
   goals met: 0 of 3
3. (move-inside cleanbot housetile-5 housetile-2)
   deleted: (at cleanbot housetile-5) (clear housetile-2)
   added: (at cleanbot housetile-2)
   goals met: 0 of 3
4. (grab cleanbot plastic housetile-1 housetile-2 housesurface)
   deleted: (on plastic housetile-1) (available cleanbot) (in plastic housesurface)
   added: (grabing cleanbot plastic)
   goals met: 0 of 3
5. (move-inside cleanbot housetile-2 housetile-5)
   deleted: (at cleanbot housetile-2) (clear housetile-5)
   added: (at cleanbot housetile-5)
   goals met: 0 of 3
6. (go-out cleanbot housetile-5 dumptile-2-3)
   deleted: (at cleanbot housetile-5) (clear dumptile-2-3)
   added: (at cleanbot dumptile-2-3)
   goals met: 0 of 3
7. (move cleanbot dumptile-2-3 dumptile-1-3)
   deleted: (at cleanbot dumptile-2-3) (clear dumptile-1-3)
   added: (at cleanbot dumptile-1-3) (clear dumptile-2-3)
   goals met: 0 of 3
8. (move cleanbot dumptile-1-3 dumptile-1-2)
   deleted: (at cleanbot dumptile-1-3) (clear dumptile-1-2)
   added: (at cleanbot dumptile-1-2) (clear dumptile-1-3)
   goals met: 0 of 3
9. (move cleanbot dumptile-1-2 dumptile-1-1)
   deleted: (at cleanbot dumptile-1-2) (clear dumptile-1-1)
   added: (at cleanbot dumptile-1-1) (clear dumptile-1-2)
   goals met: 0 of 3
10. (drop cleanbot plastic dumptile-2-1 dumptile-1-1 plasticbin)
   deleted: (grabing cleanbot plastic) (clear dumptile-2-1)
   added: (available cleanbot) (on plastic dumptile-2-1) (in plastic plasticbin)
   goals met: 1 of 3
11. (move cleanbot dumptile-1-1 dumptile-1-2)
   deleted: (at cleanbot dumptile-1-1) (clear dumptile-1-2)
   added: (at cleanbot dumptile-1-2) (clear dumptile-1-1)
   goals met: 1 of 3
12. (move cleanbot dumptile-1-2 dumptile-1-3)
   deleted: (at cleanbot dumptile-1-2) (clear dumptile-1-3)
   added: (at cleanbot dumptile-1-3) (clear dumptile-1-2)
   goals met: 1 of 3
13. (move cleanbot dumptile-1-3 dumptile-2-3)
   deleted: (at cleanbot dumptile-1-3) (clear dumptile-2-3)
   added: (at cleanbot dumptile-2-3) (clear dumptile-1-3)
   goals met: 1 of 3
14. (go-in cleanbot dumptile-2-3 housetile-5)
   deleted: (at cleanbot dumptile-2-3)
   added: (at cleanbot housetile-5) (clear dumptile-2-3)
   goals met: 1 of 3
15. (grab cleanbot glass housetile-2 housetile-5 housesurface)
   deleted: (on glass housetile-2) (available cleanbot) (in glass housesurface)
   added: (clear housetile-2) (grabing cleanbot glass)
   goals met: 1 of 3
16. (go-out cleanbot housetile-5 dumptile-2-3)
   deleted: (at cleanbot housetile-5) (clear dumptile-2-3)
   added: (at cleanbot dumptile-2-3)
   goals met: 1 of 3
17. (move cleanbot dumptile-2-3 dumptile-1-3)
   deleted: (at cleanbot dumptile-2-3) (clear dumptile-1-3)
   added: (at cleanbot dumptile-1-3) (clear dumptile-2-3)
   goals met: 1 of 3
18. (drop cleanbot glass dumptile-1-2 dumptile-1-3 glassbin)
   deleted: (grabing cleanbot glass) (clear dumptile-1-2)
   added: (available cleanbot) (on glass dumptile-1-2) (in glass glassbin)
   goals met: 2 of 3
19. (move cleanbot dumptile-1-3 dumptile-2-3)
   deleted: (at cleanbot dumptile-1-3) (clear dumptile-2-3)
   added: (at cleanbot dumptile-2-3) (clear dumptile-1-3)
   goals met: 2 of 3
20. (go-in cleanbot dumptile-2-3 housetile-5)
   deleted: (at cleanbot dumptile-2-3)
   added: (at cleanbot housetile-5) (clear dumptile-2-3)
   goals met: 2 of 3
21. (grab cleanbot organic housetile-3 housetile-5 housesurface)
   deleted: (on organic housetile-3) (available cleanbot) (in organic housesurface)
   added: (grabing cleanbot organic)
   goals met: 2 of 3
22. (go-out cleanbot housetile-5 dumptile-2-3)
   deleted: (at cleanbot housetile-5) (clear dumptile-2-3)
   added: (at cleanbot dumptile-2-3)
   goals met: 2 of 3
23. (drop cleanbot organic dumptile-1-3 dumptile-2-3 organicbin)
   deleted: (grabing cleanbot organic) (clear dumptile-1-3)
   added: (available cleanbot) (on organic dumptile-1-3) (in organic organicbin)
   goals met: 3 of 3
